#include "iter-procedures.h"

void IsGrowth()
{
	cout << "\n *Перевірка, чи впорядкована послідовність*\n\n";
	const int n = 5;
	cout << "Введіть " << n << " чисел: ";
	int a[n];
	for (int i = 0; i < n; ++i) cin >> a[i];
	int i = 1; // номер першого елемента неперевіреної частини послідовності
	// перевірка: поки ми в межах послідовності та її члени у правильному
	// порядку, можемо просуватися вперед
	while (i < n && a[i - 1] < a[i]) ++i;
	// чому закінчився цикл?
	if (i == n) cout << "Послідовність зростаюча\n";
	else cout << "Умову впорядкованості порушено перед а[" << i << "]\n";
	return;
}